# RefreshItem

## Description
Refreshes the specified item.

```pascal
PROCEDURE RefreshItem(
				liDialogID    : LONGINT;
				liComponentID : LONGINT);
```

```python

def vs.RefreshItem(liDialogID, liComponentID):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|liDialogID|LONGINT||
|liComponentID|LONGINT||

## Version
Availability: from VectorWorks12.5
## Category
* Dialogs - Modern